Repository: aireels-dev/mini-cal
Catalog: MiniCal/Resources/Localizations/Localizable.xcstrings
Source language: en
Languages: ar, fa, he, ja, ko, th, tr, ur, vi, zh_hans, zh_hant

# settings.calendar.description
source: Display secondary calendar below Gregorian date
ar: عرض التقويم الثانوي أسفل التاريخ الميلادي
fa: نمایش تقویم ثانویه در زیر تاریخ میلادی
he: הצג לוח שנה משני מתחת לתאריך הגרגוריאני
ja: グレゴリオ暦の下にセカンダリカレンダーを表示
ko: 그레고리력 날짜 아래에 보조 달력 표시
th: แสดงปฏิทินรองด้านล่างวันที่ปฏิทินเกรกอเรียน
tr: Miladi tarihin altında ikincil takvimi göster
ur: عیسوی تاریخ کے نیچے ثانوی کیلنڈر دکھائیں
vi: Hiển thị lịch phụ bên dưới ngày Dương lịch
zh_hans: 在公历日期下方显示本地历法
zh_hant: 在公曆日期下方顯示本地曆法

# settings.calendar.external_subscriptions
source: External Subscriptions
ar: الاشتراكات الخارجية
fa: اشتراک‌های خارجی
he: מינויים חיצוניים
ja: 外部サブスクリプション
ko: 외부 구독
th: การสมัครสมาชิกภายนอก
tr: Harici Abonelikler
ur: بیرونی رکنیتیں
vi: Đăng ký ngoài
zh_hans: 外部订阅
zh_hant: 外部訂閱

# settings.calendar.hover_delay_label
source: Delay
ar: التأخير
fa: تاخیر
he: עיכוב
ja: 遅延
ko: 지연
th: หน่วงเวลา
tr: Gecikme
ur: تاخیر
vi: Độ trễ
zh_hans: 延迟
zh_hant: 延遲

# settings.calendar.hover_delay_seconds
source: Delay: %.1fs
ar: التأخير: %.1fث
fa: تاخیر: %.1fث
he: עיכוב: %.1fש
ja: 遅延: %.1f秒
ko: 지연: %.1f초
th: หน่วงเวลา: %.1fวินาที
tr: Gecikme: %.1fs
ur: تاخیر: %.1fس
vi: Độ trễ: %.1fs
zh_hans: 延迟: %.1f秒
zh_hant: 延遲: %.1f秒

# settings.calendar.hover_enable
source: Enable Hover Display
ar: تمكين العرض عند التمرير
fa: فعال‌سازی نمایش شناور
he: אפשר תצוגה בריחוף
ja: ホバー表示を有効化
ko: 호버 표시 활성화
th: เปิดใช้งานการแสดงเมื่อชี้เมาส์
tr: Fareyle Gösterimi Etkinleştir
ur: ہوور ڈسپلے فعال کریں
vi: Bật hiển thị khi di chuột
zh_hans: 启用悬浮展示
zh_hant: 啟用懸浮展示

# settings.calendar.interaction
source: Calendar Interaction
ar: تفاعل التقويم
fa: تعامل تقویم
he: אינטראקציה עם לוח שנה
ja: カレンダー操作
ko: 캘린더 상호작용
th: การโต้ตอบปฏิทิน
tr: Takvim Etkileşimi
ur: کیلنڈر انٹریکشن
vi: Tương tác lịch
zh_hans: 日历交互
zh_hant: 日曆互動

# settings.calendar.local_management
source: Local Management
ar: الإدارة المحلية
fa: مدیریت محلی
he: ניהול מקומי
ja: ローカル管理
ko: 로컬 관리
th: การจัดการท้องถิ่น
tr: Yerel Yönetim
ur: مقامی انتظام
vi: Quản lý cục bộ
zh_hans: 本地管理
zh_hant: 本地管理

# settings.calendar.none
source: None
ar: لا شيء
fa: هیچ
he: ללא
ja: なし
ko: 없음
th: ไม่มี
tr: Yok
ur: کوئی نہیں
vi: Không
zh_hans: 不显示
zh_hant: 不顯示

# settings.calendar.secondary
source: Secondary Calendar
ar: التقويم الثانوي
fa: تقویم ثانویه
he: לוח שנה משני
ja: セカンダリカレンダー
ko: 보조 달력
th: ปฏิทินรอง
tr: İkincil Takvim
ur: ثانوی کیلنڈر
vi: Lịch phụ
zh_hans: 本地历法
zh_hant: 本地曆法

# settings.calendar.system_sync
source: System Sync
ar: مزامنة النظام
fa: همگام‌سازی سیستم
he: סנכרון מערכת
ja: システム同期
ko: 시스템 동기화
th: ซิงค์ระบบ
tr: Sistem Senkronizasyonu
ur: نظام کی مطابقت
vi: Đồng bộ hệ thống
zh_hans: 系统同步
zh_hant: 系統同步

# settings.calendar.type
source: Calendar Type
ar: نوع التقويم
fa: نوع تقویم
he: סוג לוח שנה
ja: カレンダーの種類
ko: 달력 유형
th: ประเภทปฏิทิน
tr: Takvim Türü
ur: کیلنڈر کی قسم
vi: Loại lịch
zh_hans: 历法类型
zh_hant: 曆法類型

# settings.calendar.type_label
source: Calendar Type
ar: نوع التقويم
fa: نوع تقویم
he: סוג לוח שנה
ja: 暦の種類
ko: 달력 유형
th: ประเภทปฏิทิน
tr: Takvim Türü
ur: کیلنڈر کی قسم
vi: Loại lịch
zh_hans: 历法类型
zh_hant: 曆法類型

# settings.format.am_pm
source: AM/PM
ar: ص/م
fa: ق.ظ/ب.ظ
ja: 午前/午後
ko: 오전/오후
th: ก่อนเที่ยง/หลังเที่ยง
tr: ÖÖ/ÖS
ur: صبح/شام
vi: Sáng/Chiều
zh_hans: 上午/下午
zh_hant: 上午/下午

# settings.format.custom
source: Custom Format
ar: تنسيق مخصص
fa: قالب سفارشی
he: פורמט מותאם אישית
ja: カスタムフォーマット
ko: 사용자 정의 형식
th: รูปแบบที่กำหนดเอง
tr: Özel Biçim
ur: کسٹم فارمیٹ
vi: Định dạng tùy chỉnh
zh_hans: 自定义格式
zh_hant: 自訂格式

# settings.format.day
source: Day
ar: اليوم
fa: روز
he: יום
ja: 日
ko: 일
th: วัน
tr: Gün
ur: دن
vi: Ngày
zh_hans: 日期
zh_hant: 日期

# settings.format.day_padded
source: Day (Zero-padded)
ar: اليوم (بصفر)
fa: روز (با صفر)
he: יום (עם אפס)
ja: 日（ゼロ埋め）
ko: 일 (0 채우기)
th: วัน (เติม 0)
tr: Gün (Sıfır Eklenmiş)
ur: دن (صفر کے ساتھ)
vi: Ngày (Thêm số 0)
zh_hans: 日期（补零）
zh_hant: 日期（補零）

# settings.format.edit_help
source: Edit Format
ar: تحرير التنسيق
fa: ویرایش قالب
he: ערוך פורמט
ja: フォーマットを編集
ko: 형식 편집
th: แก้ไขรูปแบบ
tr: Biçimi Düzenle
ur: فارمیٹ میں ترمیم
vi: Chỉnh sửa định dạng
zh_hans: 编辑格式
zh_hant: 編輯格式

# settings.format.hour_12
source: 12-hour
ar: 12 ساعة
fa: 12 ساعته
he: 12 שעות
ja: 12時間
ko: 12시간
th: 12 ชั่วโมง
tr: 12 saat
ur: 12 گھنٹے
vi: 12 giờ
zh_hans: 12小时
zh_hant: 12小時

# settings.format.hour_24
source: 24-hour
ar: 24 ساعة
fa: 24 ساعته
he: 24 שעות
ja: 24時間
ko: 24시간
th: 24 ชั่วโมง
tr: 24 saat
ur: 24 گھنٹے
vi: 24 giờ
zh_hans: 24小时
zh_hant: 24小時

# settings.format.minute
source: Minute
ar: الدقيقة
fa: دقیقه
he: דקה
ja: 分
ko: 분
th: นาที
tr: Dakika
ur: منٹ
vi: Phút
zh_hans: 分钟
zh_hant: 分鐘

# settings.format.month
source: Month
ar: الشهر
fa: ماه
he: חודש
ja: 月
ko: 월
th: เดือน
tr: Ay
ur: مہینہ
vi: Tháng
zh_hans: 月份
zh_hant: 月份

# settings.format.month_padded
source: Month (Zero-padded)
ar: الشهر (بصفر)
fa: ماه (با صفر)
he: חודש (עם אפס)
ja: 月（ゼロ埋め）
ko: 월 (0 채우기)
th: เดือน (เติม 0)
tr: Ay (Sıfır Eklenmiş)
ur: مہینہ (صفر کے ساتھ)
vi: Tháng (Thêm số 0)
zh_hans: 月份（补零）
zh_hant: 月份（補零）

# settings.format.second
source: Second
ar: الثانية
fa: ثانیه
he: שנייה
ja: 秒
ko: 초
th: วินาที
tr: Saniye
ur: سیکنڈ
vi: Giây
zh_hans: 秒
zh_hant: 秒

# settings.format.week_of_month
source: Week of Month
ar: أسبوع الشهر
fa: هفته ماه
he: שבוע בחודש
ja: 月の週番号
ko: 월중 주차
th: สัปดาห์ที่ของเดือน
tr: Ayın Haftası
ur: مہینے کا ہفتہ
vi: Tuần trong tháng
zh_hans: 月中第几周
zh_hant: 月中第幾週

# settings.format.week_of_year
source: Week of Year
ar: أسبوع السنة
fa: هفته سال
he: שבוע בשנה
ja: 年の週番号
ko: 연중 주차
th: สัปดาห์ที่ของปี
tr: Yılın Haftası
ur: سال کا ہفتہ
vi: Tuần trong năm
zh_hans: 第几周
zh_hant: 第幾週

# settings.format.weekday
source: Weekday
ar: يوم الأسبوع
fa: روز هفته
he: יום בשבוע
ja: 曜日
ko: 요일
th: วันในสัปดาห์
tr: Haftanın Günü
ur: ہفتے کا دن
vi: Thứ
zh_hans: 星期
zh_hant: 星期

# settings.format.year_2digit
source: 2-digit Year
ar: سنة من رقمين
fa: سال 2 رقمی
he: שנה בת 2 ספרות
ja: 2桁の年
ko: 2자리 연도
th: ปี 2 หลัก
tr: 2 Haneli Yıl
ur: 2 ہندسوں کا سال
vi: Năm 2 chữ số
zh_hans: 两位年份
zh_hant: 兩位年份

# settings.format.year_4digit
source: 4-digit Year
ar: سنة من 4 أرقام
fa: سال 4 رقمی
he: שנה בת 4 ספרות
ja: 4桁の年
ko: 4자리 연도
th: ปี 4 หลัก
tr: 4 Haneli Yıl
ur: 4 ہندسوں کا سال
vi: Năm 4 chữ số
zh_hans: 四位年份
zh_hant: 四位年份

# settings.gestures.swipe_down
source: Swipe Down
ar: تمرير لأسفل
fa: کشیدن به پایین
he: החלק למטה
ja: 下スワイプ
ko: 아래로 스와이프
th: ปัดลง
tr: Aşağı Kaydır
ur: نیچے سوائپ کریں
vi: Vuốt xuống
zh_hans: 下滑
zh_hant: 下滑

# settings.gestures.swipe_left
source: Swipe Left
ar: تمرير يساراً
fa: کشیدن به چپ
he: החלק שמאלה
ja: 左スワイプ
ko: 왼쪽으로 스와이프
th: ปัดซ้าย
tr: Sola Kaydır
ur: بائیں سوائپ کریں
vi: Vuốt trái
zh_hans: 左滑
zh_hant: 左滑

# settings.gestures.swipe_right
source: Swipe Right
ar: تمرير يميناً
fa: کشیدن به راست
he: החלק ימינה
ja: 右スワイプ
ko: 오른쪽으로 스와이프
th: ปัดขวา
tr: Sağa Kaydır
ur: دائیں سوائپ کریں
vi: Vuốt phải
zh_hans: 右滑
zh_hant: 右滑

# settings.gestures.swipe_up
source: Swipe Up
ar: تمرير لأعلى
fa: کشیدن به بالا
he: החלק למעלה
ja: 上スワイプ
ko: 위로 스와이프
th: ปัดขึ้น
tr: Yukarı Kaydır
ur: اوپر سوائپ کریں
vi: Vuốt lên
zh_hans: 上滑
zh_hant: 上滑

# settings.language.auto
source: Auto (Follow System)
ar: تلقائي (اتبع النظام)
fa: خودکار (پیروی از سیستم)
he: אוטומטי (עקוב אחר המערכת)
ja: 自動（システムに従う）
ko: 자동 (시스템 따라가기)
th: อัตโนมัติ (ตามระบบ)
tr: Otomatik (Sistemi Takip Et)
ur: خودکار (سسٹم کی پیروی کریں)
vi: Tự động (Theo hệ thống)
zh_hans: 自动（跟随系统）
zh_hant: 自動（跟隨系統）

# settings.language.current
source: Current Language:
ar: اللغة الحالية:
fa: زبان فعلی:
he: שפה נוכחית:
ja: 現在の言語：
ko: 현재 언어:
th: ภาษาปัจจุบัน:
tr: Mevcut Dil:
ur: موجودہ زبان:
vi: Ngôn ngữ hiện tại:
zh_hans: 当前语言：
zh_hant: 當前語言：

# settings.language.description
source: Set the display language for menu bar, settings, and UI elements
ar: تعيين لغة العرض لشريط القوائم والإعدادات وعناصر واجهة المستخدم
fa: تنظیم زبان نمایش برای نوار منو، تنظیمات و عناصر رابط کاربری
he: הגדר את שפת התצוגה עבור שורת התפריט, ההגדרות ורכיבי ממשק המשתמש
ja: メニューバー、設定、UI要素の表示言語を設定します
ko: 메뉴바, 설정 및 UI 요소의 표시 언어 설정
th: ตั้งค่าภาษาที่แสดงสำหรับแถบเมนู การตั้งค่า และองค์ประกอบ UI
tr: Menü çubuğu, ayarlar ve kullanıcı arayüzü öğeleri için görüntüleme dilini ayarlayın
ur: مینو بار، ترتیبات اور UI عناصر کے لیے ڈسپلے زبان مقرر کریں
vi: Đặt ngôn ngữ hiển thị cho thanh menu, cài đặt và các phần tử giao diện
zh_hans: 设置菜单栏、设置界面和UI元素的显示语言
zh_hant: 設定選單欄、設定介面和UI元素的顯示語言

# settings.language.interface
source: Interface Language
ar: لغة الواجهة
fa: زبان رابط کاربری
he: שפת הממשק
ja: インターフェース言語
ko: 인터페이스 언어
th: ภาษาอินเทอร์เฟซ
tr: Arayüz Dili
ur: انٹرفیس کی زبان
vi: Ngôn ngữ giao diện
zh_hans: 界面语言
zh_hant: 介面語言

# settings.language.section
source: Language
ar: اللغة
fa: زبان
he: שפה
ja: 言語
ko: 언어
th: ภาษา
tr: Dil
ur: زبان
vi: Ngôn ngữ
zh_hans: 语言
zh_hant: 語言

# settings.menu_bar.24hour
source: 24-hour Format
ar: نظام 24 ساعة
fa: قالب 24 ساعته
he: פורמט 24 שעות
ja: 24時間表示
ko: 24시간 형식
th: รูปแบบ 24 ชั่วโมง
tr: 24 Saat Formatı
ur: 24 گھنٹے کا فارمیٹ
vi: Định dạng 24 giờ
zh_hans: 24小时制
zh_hant: 24小時制

# settings.menu_bar.display
source: Menu Bar Display
ar: عرض شريط القوائم
fa: نمایش نوار منو
he: תצוגת שורת התפריטים
ja: メニューバー表示
ko: 메뉴 바 표시
th: การแสดงแถบเมนู
tr: Menü Çubuğu Görünümü
ur: مینیو بار ڈسپلے
vi: Hiển thị thanh menu
zh_hans: 菜单栏显示
zh_hant: 選單欄顯示

# settings.menu_bar.format
source: Format
ar: التنسيق
fa: قالب
he: פורמט
ja: フォーマット
ko: 형식
th: รูปแบบ
tr: Biçim
ur: فارمیٹ
vi: Định dạng
zh_hans: 格式
zh_hant: 格式

# settings.menu_bar.show_seconds
source: Show Seconds
ar: إظهار الثواني
fa: نمایش ثانیه
he: הצג שניות
ja: 秒を表示
ko: 초 표시
th: แสดงวินาที
tr: Saniyeleri Göster
ur: سیکنڈ دکھائیں
vi: Hiển thị giây
zh_hans: 显示秒
zh_hant: 顯示秒

# settings.menu_bar.show_weekday
source: Show Weekday
ar: إظهار يوم الأسبوع
fa: نمایش روز هفته
he: הצג יום בשבוע
ja: 曜日を表示
ko: 요일 표시
th: แสดงวันในสัปดาห์
tr: Haftanın Gününü Göster
ur: ہفتے کا دن دکھائیں
vi: Hiển thị thứ
zh_hans: 显示星期
zh_hant: 顯示星期

# settings.notes.glass_effect
source: Calendar popup uses macOS Glass effect
ar: تستخدم النافذة المنبثقة للتقويم تأثير Glass من macOS
fa: پنجره بازشو تقویم از افکت Glass macOS استفاده می‌کند
he: חלון קופץ של לוח השנה משתמש באפקט Glass של macOS
ja: カレンダーポップアップは macOS Glass エフェクトを使用
ko: 캘린더 팝업은 macOS Glass 효과를 사용합니다
th: ป๊อปอัพปฏิทินใช้เอฟเฟกต์ Glass ของ macOS
tr: Takvim açılır penceresi macOS Glass efektini kullanır
ur: کیلنڈر پاپ اپ macOS Glass اثر استعمال کرتا ہے
vi: Cửa sổ bật lên lịch sử dụng hiệu ứng Glass macOS
zh_hans: 日历弹窗使用 macOS Glass 效果
zh_hant: 日曆彈窗使用 macOS Glass 效果

# settings.notes.panel_size
source: Adjusting panel size provides a better visual experience
ar: يوفر تعديل حجم اللوحة تجربة بصرية أفضل
fa: تنظیم اندازه پانل تجربه بصری بهتری فراهم می‌کند
he: התאמת גודל הפאנל מספקת חוויה ויזואלית טובה יותר
ja: パネルサイズの調整により、より良い視覚体験が得られます
ko: 패널 크기를 조정하면 더 나은 시각적 경험을 제공합니다
th: การปรับขนาดแผงให้ประสบการณ์การมองเห็นที่ดีขึ้น
tr: Panel boyutunu ayarlamak daha iyi bir görsel deneyim sağlar
ur: پینل کا سائز ایڈجسٹ کرنے سے بہتر بصری تجربہ ملتا ہے
vi: Điều chỉnh kích thước bảng cung cấp trải nghiệm hình ảnh tốt hơn
zh_hans: 调整面板大小可以获得更好的视觉体验
zh_hant: 調整面板大小可以獲得更好的視覺體驗

# settings.notes.section
source: Notes
ar: ملاحظات
fa: یادداشت‌ها
he: הערות
ja: 注意事項
ko: 참고 사항
th: หมายเหตุ
tr: Notlar
ur: نوٹس
vi: Ghi chú
zh_hans: 说明
zh_hant: 說明

# settings.reset_theme
source: Reset to default theme (Auto mode + Classic Blue/Midnight Blue)
ar: إعادة تعيين إلى المظهر الافتراضي (الوضع التلقائي + الأزرق الكلاسيكي/أزرق منتصف الليل)
fa: بازنشانی به تم پیش‌فرض (حالت خودکار + آبی کلاسیک/آبی نیمه‌شب)
he: אפס לערכת נושא ברירת מחדל (מצב אוטומטי + כחול קלאסי/כחול חצות)
ja: デフォルトテーマにリセット（自動モード + クラシックブルー/ミッドナイトブルー）
ko: 기본 테마로 재설정 (자동 모드 + 클래식 블루/미드나이트 블루)
th: รีเซ็ตเป็นธีมเริ่มต้น (โหมดอัตโนมัติ + สีน้ำเงินคลาสสิก/สีน้ำเงินเที่ยงคืน)
tr: Varsayılan temaya sıfırla (Otomatik mod + Klasik Mavi/Gece Yarısı Mavisi)
ur: ڈیفالٹ تھیم پر ری سیٹ کریں (خودکار موڈ + کلاسک بلیو/مڈ نائٹ بلیو)
vi: Đặt lại về chủ đề mặc định (Chế độ tự động + Xanh cổ điển/Xanh nửa đêm)
zh_hans: 重置为默认主题（自动模式 + 经典蓝/午夜蓝）
zh_hant: 重置為默認主題（自動模式 + 經典藍/午夜藍）

# settings.shortcuts.arrow_keys
source: Arrow Keys
ar: مفاتيح الأسهم
fa: کلیدهای جهت
he: מקשי חצים
ja: 矢印キー
ko: 화살표 키
th: ปุ่มลูกศร
tr: Ok Tuşları
ur: تیر کی کلیدیں
vi: Phím mũi tên
zh_hans: 箭头键切换
zh_hant: 箭頭鍵切換

# settings.shortcuts.next_month
source: Next Month
ar: الشهر التالي
fa: ماه بعد
he: חודש הבא
ja: 次月
ko: 다음 달
th: เดือนถัดไป
tr: Sonraki Ay
ur: اگلا مہینہ
vi: Tháng sau
zh_hans: 下个月
zh_hant: 下個月

# settings.shortcuts.next_year
source: Next Year
ar: السنة التالية
fa: سال بعد
he: שנה הבאה
ja: 次年
ko: 다음 연도
th: ปีถัดไป
tr: Sonraki Yıl
ur: اگلا سال
vi: Năm sau
zh_hans: 下一年
zh_hant: 下一年

# settings.shortcuts.prev_month
source: Previous Month
ar: الشهر السابق
fa: ماه قبل
he: חודש קודם
ja: 前月
ko: 이전 달
th: เดือนก่อนหน้า
tr: Önceki Ay
ur: پچھلا مہینہ
vi: Tháng trước
zh_hans: 上个月
zh_hant: 上個月

# settings.shortcuts.prev_year
source: Previous Year
ar: السنة السابقة
fa: سال قبل
he: שנה קודמת
ja: 前年
ko: 이전 연도
th: ปีก่อนหน้า
tr: Önceki Yıl
ur: پچھلا سال
vi: Năm trước
zh_hans: 上一年
zh_hant: 上一年

# settings.shortcuts.section
source: Shortcuts & Gestures
ar: الاختصارات والإيماءات
fa: میانبرها و حرکات
he: קיצורי דרך ומחוות
ja: ショートカットとジェスチャー
ko: 단축키 및 제스처
th: ปุ่มลัดและท่าทาง
tr: Kısayollar ve Hareketler
ur: شارٹ کٹس اور اشارے
vi: Phím tắt & Cử chỉ
zh_hans: 快捷键与手势
zh_hant: 快捷鍵與手勢

# settings.shortcuts.trackpad
source: Trackpad Gestures
ar: إيماءات لوحة التتبع
fa: حرکات تاچ‌پد
he: מחוות משטח מגע
ja: トラックパッドジェスチャー
ko: 트랙패드 제스처
th: ท่าทางแทร็กแพด
tr: Trackpad Hareketleri
ur: ٹریک پیڈ اشارے
vi: Cử chỉ bàn rê
zh_hans: 触摸板手势
zh_hant: 觸摸板手勢

# settings.shortcuts.wasd_keys
source: WASD Keys
ar: مفاتيح WASD
fa: کلیدهای WASD
he: מקשי WASD
ja: WASDキー
ko: WASD 키
th: ปุ่ม WASD
tr: WASD Tuşları
ur: WASD کلیدیں
vi: Phím WASD
zh_hans: WASD键切换
zh_hant: WASD鍵切換

# settings.shortcuts.zoom
source: Zoom
ar: التكبير
fa: زوم
he: זום
ja: ズーム
ko: 확대/축소
th: ซูม
tr: Yakınlaştır
ur: زوم
vi: Thu phóng
zh_hans: 缩放调整
zh_hant: 縮放調整

# settings.shortcuts.zoom_in
source: Zoom In
ar: تكبير
fa: بزرگنمایی
he: הגדל
ja: 拡大
ko: 확대
th: ขยาย
tr: Yakınlaştır
ur: بڑا کریں
vi: Phóng to
zh_hans: 放大
zh_hant: 放大

# settings.shortcuts.zoom_out
source: Zoom Out
ar: تصغير
fa: کوچک‌نمایی
he: הקטן
ja: 縮小
ko: 축소
th: ซูมออก
tr: Uzaklaştır
ur: چھوٹا کریں
vi: Thu nhỏ
zh_hans: 缩小
zh_hant: 縮小

# settings.size_description
source: Ratio
ar: النسبة
fa: نسبت
he: יחס
ja: 比率
ko: 비율
th: อัตราส่วน
tr: Oran
ur: تناسب
vi: Tỷ lệ
zh_hans: 比例
zh_hant: 比例

# settings.theme_auto_switch
source: 💡 When system appearance changes, it will automatically switch to your selected theme for that mode
ar: 💡 عندما يتغير مظهر النظام، سيتم التبديل تلقائياً إلى المظهر المحدد لهذا الوضع
fa: 💡 هنگامی که ظاهر سیستم تغییر می‌کند، به‌طور خودکار به تم انتخابی شما برای آن حالت تغییر می‌کند
he: 💡 כאשר מראה המערכת משתנה, זה יעבור אוטומטית לערכת הנושא שבחרת עבור מצב זה
ja: 💡 システム外観が変更されると、そのモードで選択したテーマに自動的に切り替わります
ko: 💡 시스템 외관이 변경되면 해당 모드에서 선택한 테마로 자동 전환됩니다
th: 💡 เมื่อรูปลักษณ์ระบบเปลี่ยนแปลง จะสลับไปยังธีมที่คุณเลือกสำหรับโหมดนั้นโดยอัตโนมัติ
tr: 💡 Sistem görünümü değiştiğinde, o mod için seçtiğiniz temaya otomatik olarak geçecektir
ur: 💡 جب سسٹم کی ظاہری شکل تبدیل ہوتی ہے، تو یہ خودکار طور پر اس موڈ کے لیے آپ کے منتخب کردہ تھیم میں سوئچ ہو جائے گا
vi: 💡 Khi giao diện hệ thống thay đổi, sẽ tự động chuyển sang chủ đề đã chọn cho chế độ đó
zh_hans: 💡 系统外观变化时，将自动切换到对应模式下您选择的主题
zh_hant: 💡 系統外觀變化時，將自動切換到對應模式下您選擇的主題

# settings.week_start.description
source: Set the first day of week in calendar grid, affects layout and weekday headers
ar: حدد أول يوم في الأسبوع في شبكة التقويم، يؤثر على التخطيط وعناوين أيام الأسبوع
fa: روز اول هفته را در شبکه تقویم تنظیم می‌کند و بر چیدمان و عنوان‌های روزها اثر می‌گذارد
he: קובע את היום הראשון בשבוע בתצוגת לוח השנה ומשפיע על הפריסה וכותרות הימים
ja: カレンダーの週の開始日を設定します。レイアウトと曜日ヘッダーに影響します
ko: 달력 그리드에서 한 주의 시작일을 설정하며 레이아웃과 요일 헤더에 영향을 줍니다
th: กำหนดวันเริ่มต้นของสัปดาห์ในตารางปฏิทิน ส่งผลต่อเลย์เอาต์และหัวข้อวันในสัปดาห์
tr: Takvim ızgarasında haftanın ilk gününü ayarlar; düzeni ve hafta günü başlıklarını etkiler
ur: کیلنڈر گرڈ میں ہفتے کے پہلے دن کو سیٹ کریں، یہ لے آؤٹ اور ہفتہ وار ہیڈر پر اثر انداز ہوتا ہے
vi: Đặt ngày bắt đầu tuần trong lưới lịch, ảnh hưởng đến bố cục và tiêu đề ngày trong tuần
zh_hans: 设置日历网格中每周的起始日，影响日历布局和星期头部显示
zh_hant: 設置日曆網格中每週的起始日，影響日曆佈局和星期頭部顯示

# settings.week_start.label
source: Week starts on
ar: يبدأ الأسبوع في
fa: شروع هفته
he: תחילת השבוע
ja: 週の開始
ko: 주 시작 요일
th: เริ่มสัปดาห์ที่
tr: Hafta başlangıcı
ur: ہفتہ شروع ہوتا ہے
vi: Bắt đầu tuần vào
zh_hans: 每周起始日
zh_hant: 每週起始日

# settings.window_title
source: %@ Settings
ar: إعدادات %@
fa: تنظیمات %@
he: הגדרות %@
ja: %@ 設定
ko: %@ 설정
th: การตั้งค่า %@
tr: %@ Ayarları
ur: %@ ترتیبات
vi: Cài đặt %@
zh_hans: %@ 设置
zh_hant: %@ 設置

# size.compact
source: Compact
ar: مضغوط
fa: فشرده
he: קומפקטי
ja: コンパクト
ko: 작게
th: กะทัดรัด
tr: Kompakt
ur: کمپیکٹ
vi: Nhỏ gọn
zh_hans: 紧凑
zh_hant: 緊湊

# size.large
source: Large
ar: كبير
fa: بزرگ
he: גדול
ja: 大
ko: 크게
th: ใหญ่
tr: Büyük
ur: بڑا
vi: Lớn
zh_hans: 大号
zh_hant: 大號

# size.standard
source: Standard
ar: قياسي
fa: استاندارد
he: סטנדרטי
ja: 標準
ko: 표준
th: มาตรฐาน
tr: Standart
ur: معیاری
vi: Tiêu chuẩn
zh_hans: 标准
zh_hant: 標準

# size.xlarge
source: Extra Large
ar: كبير جداً
fa: بسیار بزرگ
he: גדול במיוחד
ja: 特大
ko: 매우 크게
th: ใหญ่พิเศษ
tr: Çok Büyük
ur: بہت بڑا
vi: Rất lớn
zh_hans: 超大
zh_hant: 超大

# subscription.add
source: Add Subscription
ar: إضافة اشتراك
fa: افزودن اشتراک
he: הוסף מינוי
ja: サブスクリプションを追加
ko: 구독 추가
th: เพิ่มการสมัครสมาชิก
tr: Abonelik Ekle
ur: رکنیت شامل کریں
vi: Thêm đăng ký
zh_hans: 添加订阅
zh_hant: 添加訂閱

# subscription.add_button
source: Add Calendar Subscription
ar: إضافة اشتراك تقويم
fa: افزودن اشتراک تقویم
he: הוסף מינוי לוח שנה
ja: カレンダーサブスクリプションを追加
ko: 달력 구독 추가
th: เพิ่มการสมัครสมาชิกปฏิทิน
tr: Takvim Aboneliği Ekle
ur: کیلنڈر رکنیت شامل کریں
vi: Thêm đăng ký lịch
zh_hans: 添加日历订阅
zh_hant: 添加日曆訂閱

# subscription.add_failed
source: Failed to Add Subscription
ar: فشل إضافة الاشتراك
fa: افزودن اشتراک ناموفق
he: הוספת מנוי נכשלה
ja: 購読の追加に失敗
ko: 구독 추가 실패
th: เพิ่มการสมัครสมาชิกล้มเหลว
tr: Abonelik Eklenemedi
ur: سبسکرپشن شامل کرنا ناکام
vi: Thêm đăng ký thất bại
zh_hans: 添加订阅失败
zh_hant: 新增訂閱失敗

# subscription.add_help
source: Add new external calendar subscription
ar: إضافة اشتراك تقويم خارجي جديد
fa: افزودن اشتراک تقویم خارجی جدید
he: הוסף מנוי לוח שנה חיצוני חדש
ja: 新しい外部カレンダー購読を追加
ko: 새 외부 달력 구독 추가
th: เพิ่มการสมัครสมาชิกปฏิทินภายนอกใหม่
tr: Yeni harici takvim aboneliği ekle
ur: نیا بیرونی کیلنڈر سبسکرپشن شامل کریں
vi: Thêm đăng ký lịch bên ngoài mới
zh_hans: 添加新的外部日历订阅
zh_hant: 新增新的外部日曆訂閱

# subscription.add_title
source: Add External Subscription
ar: إضافة اشتراك خارجي
fa: افزودن اشتراک خارجی
he: הוסף מנוי חיצוני
ja: 外部購読を追加
ko: 외부 구독 추가
th: เพิ่มการสมัครสมาชิกภายนอก
tr: Harici Abonelik Ekle
ur: بیرونی سبسکرپشن شامل کریں
vi: Thêm đăng ký bên ngoài
zh_hans: 添加外部订阅
zh_hant: 添加外部訂閱

# subscription.add_to_view
source: Add external calendar subscriptions to view more events
ar: أضف اشتراكات تقويم خارجية لعرض المزيد من الأحداث
fa: اشتراک‌های تقویم خارجی را اضافه کنید تا رویدادهای بیشتری ببینید
he: הוסף מינויי לוח שנה חיצוניים כדי לראות עוד אירועים
ja: 外部カレンダーサブスクリプションを追加して、さらに多くのイベントを表示
ko: 더 많은 이벤트를 보려면 외부 달력 구독 추가
th: เพิ่มการสมัครสมาชิกปฏิทินภายนอกเพื่อดูเหตุการณ์เพิ่มเติม
tr: Daha fazla etkinlik görmek için harici takvim abonelikleri ekleyin
ur: مزید واقعات دیکھنے کے لیے بیرونی کیلنڈر رکنیتیں شامل کریں
vi: Thêm đăng ký lịch bên ngoài để xem thêm sự kiện
zh_hans: 添加外部日历订阅来查看更多事件
zh_hant: 添加外部日曆訂閱來查看更多事件

# subscription.adding
source: Adding subscription...
ar: جارٍ إضافة الاشتراك...
fa: در حال افزودن اشتراک...
he: מוסיף מינוי...
ja: サブスクリプションを追加中...
ko: 구독 추가 중...
th: กำลังเพิ่มการสมัครสมาชิก...
tr: Abonelik ekleniyor...
ur: رکنیت شامل کی جا رہی ہے...
vi: Đang thêm đăng ký...
zh_hans: 正在添加订阅...
zh_hant: 正在添加訂閱...

# subscription.calendar_url
source: Calendar URL
ar: عنوان URL للتقويم
fa: آدرس URL تقویم
he: כתובת URL של לוח שנה
ja: カレンダーURL
ko: 달력 URL
th: URL ปฏิทิน
tr: Takvim URL'si
ur: کیلنڈر URL
vi: URL lịch
zh_hans: 日历URL
zh_hant: 日曆URL

# subscription.click_to_add
source: Click 'Add Subscription' button below to start
ar: انقر فوق زر 'إضافة اشتراك' أدناه للبدء
fa: برای شروع روی دکمه 'افزودن اشتراک' زیر کلیک کنید
he: לחץ על כפתור 'הוסף מנוי' למטה כדי להתחיל
ja: 下の「購読を追加」ボタンをクリックして開始
ko: 시작하려면 아래 '구독 추가' 버튼을 클릭하세요
th: คลิกปุ่ม 'เพิ่มการสมัครสมาชิก' ด้านล่างเพื่อเริ่มต้น
tr: Başlamak için aşağıdaki 'Abonelik Ekle' düğmesine tıklayın
ur: شروع کرنے کے لیے نیچے 'سبسکرپشن شامل کریں' بٹن پر کلک کریں
vi: Nhấp vào nút 'Thêm đăng ký' bên dưới để bắt đầu
zh_hans: 点击下方「添加订阅」按钮开始
zh_hant: 點擊下方「新增訂閱」按鈕開始

# subscription.common_services
source: Common Calendar Services
ar: خدمات التقويم الشائعة
fa: سرویس‌های رایج تقویم
he: שירותי לוח שנה נפוצים
ja: 一般的なカレンダーサービス
ko: 일반 달력 서비스
th: บริการปฏิทินทั่วไป
tr: Yaygın Takvim Hizmetleri
ur: عام کیلنڈر خدمات
vi: Dịch vụ lịch phổ biến
zh_hans: 常见日历服务
zh_hant: 常見日曆服務

# subscription.confirm_delete_message
source: Are you sure you want to delete the subscription "%@"?
ar: هل أنت متأكد من حذف الاشتراك "%@"؟
fa: آیا مطمئن هستید که می‌خواهید اشتراک "%@" را حذف کنید؟
he: האם אתה בטוח שברצונך למחוק את המנוי "%@"?
ja: サブスクリプション「%@」を削除してもよろしいですか？
ko: 구독 "%@"을(를) 삭제하시겠습니까?
th: คุณแน่ใจหรือไม่ที่จะลบการสมัคร "%@"
tr: "%@" aboneliğini silmek istediğinizden emin misiniz?
ur: کیا آپ واقعی "%@" سبسکرپشن کو حذف کرنا چاہتے ہیں؟
vi: Bạn có chắc chắn muốn xóa đăng ký "%@"?
zh_hans: 确定要删除订阅「%@」吗？
zh_hant: 確定要刪除訂閱「%@」嗎？

# subscription.confirm_delete_title
source: Confirm Delete
ar: تأكيد الحذف
fa: تأیید حذف
he: אשר מחיקה
ja: 削除の確認
ko: 삭제 확인
th: ยืนยันการลบ
tr: Silmeyi Onayla
ur: حذف کی تصدیق کریں
vi: Xác nhận xóa
zh_hans: 确认删除
zh_hant: 確認刪除

# subscription.downloading
source: Verifying and downloading calendar data
ar: التحقق وتنزيل بيانات التقويم
fa: در حال تأیید و دانلود داده‌های تقویم
he: מאמת ומוריד נתוני לוח שנה
ja: カレンダーデータを検証してダウンロード中
ko: 달력 데이터 확인 및 다운로드 중
th: กำลังตรวจสอบและดาวน์โหลดข้อมูลปฏิทิน
tr: Takvim verileri doğrulanıyor ve indiriliyor
ur: کیلنڈر ڈیٹا کی توثیق اور ڈاؤن لوڈ کر رہا ہے
vi: Đang xác minh và tải xuống dữ liệu lịch
zh_hans: 正在验证并下载日历数据
zh_hant: 正在驗證並下載日曆數據

# subscription.event_count
source: %d events
ar: %d أحداث
fa: %d رویداد
he: %d אירועים
ja: %d 件のイベント
ko: %d개 이벤트
th: %d เหตุการณ์
tr: %d etkinlik
ur: %d واقعات
vi: %d sự kiện
zh_hans: %d 个事件
zh_hant: %d 個事件

# subscription.manager_title
source: Calendar Subscription Manager
ar: مدير اشتراك التقويم
fa: مدیر اشتراک تقویم
he: מנהל מינויי לוח שנה
ja: カレンダーサブスクリプションマネージャー
ko: 달력 구독 관리자
th: ตัวจัดการการสมัครสมาชิกปฏิทิน
tr: Takvim Abonelik Yöneticisi
ur: کیلنڈر رکنیت منتظم
vi: Quản lý đăng ký lịch
zh_hans: 日历订阅管理
zh_hant: 日曆訂閱管理

# subscription.no_subscriptions
source: No Calendar Subscriptions Yet
ar: لا توجد اشتراكات تقويم بعد
fa: هنوز اشتراک تقویمی وجود ندارد
he: עדיין אין מינויי לוח שנה
ja: まだカレンダーサブスクリプションがありません
ko: 아직 달력 구독이 없습니다
th: ยังไม่มีการสมัครสมาชิกปฏิทิน
tr: Henüz Takvim Aboneliği Yok
ur: ابھی تک کوئی کیلنڈر رکنیت نہیں
vi: Chưa có đăng ký lịch nào
zh_hans: 还没有订阅任何日历
zh_hant: 還沒有訂閱任何日曆

# subscription.protocol_hint
source: Supports https:// and webcal:// protocols
ar: يدعم بروتوكولات https:// و webcal://
fa: از پروتکل‌های https:// و webcal:// پشتیبانی می‌کند
he: תומך בפרוטוקולים https:// ו-webcal://
ja: https://、webcal:// プロトコルをサポート
ko: https://, webcal:// 프로토콜 지원
th: รองรับโปรโตคอล https:// และ webcal://
tr: https:// ve webcal:// protokollerini destekler
ur: https:// اور webcal:// پروٹوکول کو سپورٹ کرتا ہے
vi: Hỗ trợ các giao thức https:// và webcal://
zh_hans: 支持 https:// 和 webcal:// 协议
zh_hant: 支持 https:// 和 webcal:// 協議

# subscription.refresh_all
source: Refresh All
ar: تحديث الكل
fa: به‌روزرسانی همه
he: רענן הכל
ja: すべて更新
ko: 모두 새로 고침
th: รีเฟรชทั้งหมด
tr: Tümünü Yenile
ur: سب کو تازہ کریں
vi: Làm mới tất cả
zh_hans: 刷新全部
zh_hant: 刷新全部
